Revit 2027 API
StairsRunType.HasRisers Property
 True if the stairs run will include risers on steps, false otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasRisers { get; set; }
Public Property HasRisers As Boolean
	Get
	Set
public:
property bool HasRisers {
	bool get ();
	void set (bool value);
}
member HasRisers : bool with get, set
Property Value
Boolean
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace